# population table from database

In [1]:
import sqlite3
import pandas as pd

In [2]:
with sqlite3.connect('population.db') as con :
    pp=pd.read_sql("select * from population",con=con)
pp.head()

,id,first_name,last_name,email,gender,salary,state
0,1,Armin,Coltart,acoltart0@abc.net.au,Male,368693,District of Columbia
1,2,Mia,Tuddenham,mtuddenham1@addthis.com,Female,154398,Florida
2,3,Kirsteni,Brafield,kbrafield2@arizona.edu,Female,1230304,Georgia
3,4,Phylis,Furlong,pfurlong3@merriam-webster.com,Female,1567795,California
4,5,Wandis,Loveredge,wloveredge4@hatena.ne.jp,Female,1136950,Alabama

# task 1

In [4]:
(pp
 .query("""gender=='Female' and state=='Florida'""")
 .drop(columns=['id','email']) 
 ).head()

    first_name  last_name  gender  salary    state
1          Mia  Tuddenham  Female  154398  Florida
48       Doris    Wolfers  Female  278456  Florida
96      Louisa     Lummis  Female  837109  Florida
116     Cicily    Rhelton  Female  523875  Florida
128    Kirstyn     Allbon  Female  990315  Florida

# task 2

In [13]:
df=pp[pp['email'].str.endswith('@apache.org')]
cc=df['gender'].value_counts()
cc.head()

gender
Male      13
Female     8
Name: count, dtype: int64

# task 3

In [20]:
male=pp[pp['gender']=='Male']
ee=male.query('salary >= 1000000').value_counts()
ee.value_counts()

count
1    2848
Name: count, dtype: int64

# task 4

In [43]:
bb=pp[pp['state']=='Alabama'] 
bb=pp[pp['gender']=='Female']
cc=bb.query('salary <= 800000')
(cc
 .drop(columns=['id','email','gender'])
).head()

   first_name   last_name  salary                 state
1         Mia   Tuddenham  154398               Florida
11    Ronalda   Southcott  589810               Alabama
14  Josephine       Prott  133836  District of Columbia
16     Kissie    Gandrich  378146            California
20    Caressa  Karchowski  115785                 Texas

# task 5

In [60]:
inf=pp[pp['email'].str.endswith('@hotmail.com')]
(inf
 .query("""state == 'Texas'""")
 ).head()

Empty DataFrame
Columns: [id, first_name, last_name, email, gender, salary, state]
Index: []

# I think there is not an email which ends with @hotmail.com

# task 6

In [68]:
counts=(bb
.query("""gender=='Male' and state=='California'""") 
.query('salary>400000 and salary<900000')
).value_counts()
counts.value_counts()

count
1    179
Name: count, dtype: int64

# task 7

In [69]:
counts=(pp
.query("""gender=='Female' and state=='New York'""") 
.query('salary<500000') 
).value_counts()
counts.value_counts()

count
1    84
Name: count, dtype: int64

# task 8

In [79]:
high=pp[pp['state']=='Georgia']
max=(high
.sort_values(by='salary',ascending=False)
.drop(columns=['email','id'])
)
max.head(10)

     first_name last_name  gender   salary    state
7635    Susette    Emeney  Female  1999095  Georgia
2330    Emeline     Bebis  Female  1997605  Georgia
4951       Evyn   Watkins    Male  1994162  Georgia
6008    Hillyer    Praton    Male  1993907  Georgia
658    Robinett     Mucci  Female  1989791  Georgia
46       Verile   Binding  Female  1985757  Georgia
9490  Harriette   Bonwick  Female  1970839  Georgia
739       Anita    Vowles  Female  1965112  Georgia
4081      Tiffi  Lansdown  Female  1962952  Georgia
3262    Haslett     Nevin    Male  1960207  Georgia

# task 9

In [84]:
count=pp[pp['last_name'].str.startswith('S')]
bb=count.query('salary>300000').value_counts()
bb.value_counts()

count
1    951
Name: count, dtype: int64

# task 10

In [98]:
avg=(pp
.query("""gender=='Female' and state=='Oklahoma'""")
)
bb=avg['salary'].mean()
bb

np.float64(1020987.7195121951)

# task 11

In [106]:
b=pp[(pp['state']=='Florida') & (pp['email'].str.endswith('.net'))]
bb.head(20)

,id,first_name,last_name,email,gender,salary,state
327,328,Coop,Chaimson,cchaimson93@themeforest.net,Male,296781,Florida
818,819,Jobi,Cutmere,jcutmeremq@cpanel.net,Female,1561427,Florida
924,925,Chris,Garfirth,cgarfirthpo@behance.net,Female,416553,Florida
1101,1102,Waite,Rudderham,wrudderham2t@seesaa.net,Male,1259094,Florida
1242,1243,Em,Graffin,egraffin6q@clickbank.net,Female,620022,Florida
1357,1358,Patrizius,Matskevich,pmatskevich9x@comcast.net,Male,386268,Florida
1718,1719,Malanie,Harkins,mharkinsjy@seesaa.net,Female,843786,Florida
1767,1768,Abbie,Isenor,aisenorlb@php.net,Male,116336,Florida
1996,1997,Eugenio,Halhead,ehalheadro@discuz.net,Male,957513,Florida
2515,2516,Hobey,Licence,hlicenceeb@ovh.net,Male,1991845,Florida
3622,3623,Fallon,Bothe,fbotheha@a8.net,Female,678212,Florida
3842,3843,Geri,Tink,gtinkne@comcast.net,Male,522140,Florida
3853,3854,Gabriello,Yakebovitch,gyakebovitchnp@earthlink.net,Male,1590134,Florida
4406,4407,Vida,Bollon,vbollonba@earthlink.net,Female,1856203,Florida
4737,4738,Cherish,Espie,cespiekh@sourceforge.net,Female,1870875,Florida
5083,5084,Stevana,Ventris,sventris2b@ovh.net,Female,1216416,Florida
5885,5886,Denys,Abbay,dabbayol@comcast.net,Female,1414999,Florida
6092,6093,Christabella,Vacher,cvacher2k@themeforest.net,Female,138100,Florida
6127,6128,Martita,Amberger,mamberger3j@behance.net,Female,1270075,Florida
6762,6763,Arnoldo,Fairy,afairyl6@a8.net,Male,904800,Florida

# task 12

In [108]:
b=pp[pp['first_name'].str.startswith('K')]
p=(b
.query('salary<100000000')

).value_counts()
p.value_counts()

count
1    512
Name: count, dtype: int64

# task 13

In [114]:
bb=pp[(pp['email'].str.endswith('gmail.com')) & (df['salary']<200000)]
bb.head()

Empty DataFrame
Columns: [id, first_name, last_name, email, gender, salary, state]
Index: []

# task 14

In [118]:
bb=pp[(pp['gender']=='Male') & (pp['state']=='Ohio')]
bb.groupby('salary').agg(['min'])
bb.head(1)

,id,first_name,last_name,email,gender,salary,state
73,74,Adriano,Hayhurst,ahayhurst21@networkadvertising.org,Male,487763,Ohio

# task 15

In [139]:
(pp
.query("salary > 800000")
.query("""gender=='Female' and state=='California'""")
).value_counts()
pp.value_counts()

id     first_name  last_name  email                             gender  salary   state
11649  Papageno    Buchanan   pbuchanani2@pagesperso-orange.fr  Male    1271538  Florida        1
11633  Wake        Sperwell   wsperwellhm@hc360.com             Male    1916655  California     1
11632  Cathrin     Paule      cpaulehl@google.com.hk            Female  301850   Virginia       1
11631  Ana         Roony      aroonyhk@redcross.org             Female  1692096  Missouri       1
11630  Gorden      Flatman    gflatmanhj@paypal.com             Male    917108   Alabama        1
                                                                                               ..
6      Denis       Martyn     dmartyn5@unc.edu                  Male    547205   Connecticut    1
5      Wandis      Loveredge  wloveredge4@hatena.ne.jp          Female  1136950  Alabama        1
4      Phylis      Furlong    pfurlong3@merriam-webster.com     Female  1567795  California     1
3      Kirsteni    Brafield   kbrafield2@arizona.edu            Female  1230304  Georgia        1
2      Mia         Tuddenham  mtuddenham1@addthis.com           Female  154398   Florida        1
Name: count, Length: 11649, dtype: int64

# task 16

In [142]:
(pp
.query("""gender=='Male' and salary > 1200000""")
).head()

,id,first_name,last_name,email,gender,salary,state
19,20,Pat,Dunbar,pdunbarj@irs.gov,Male,1424714,Pennsylvania
24,25,Omar,Willshear,owillshearo@biglobe.ne.jp,Male,1727275,Kansas
53,54,Heath,Chick,hchick1h@netvibes.com,Male,1213441,Virginia
63,64,Wat,Persey,wpersey1r@qq.com,Male,1752514,New York
66,67,Yorke,Redolfi,yredolfi1u@abc.net.au,Male,1337608,Florida

# task 17

In [144]:
bb=pp[pp['email'].str.contains('edu')]
(bb
.query("""gender=='Male' and salary>1500000""")
).head()

,id,first_name,last_name,email,gender,salary,state
72,73,Granthem,Essberger,gessberger20@illinois.edu,Male,1587610,New Jersey
100,101,Gun,Cutler,gcutler2s@virginia.edu,Male,1673082,Texas
235,236,Gaultiero,Duddle,gduddle6j@utexas.edu,Male,1989965,Florida
301,302,Brander,Couvert,bcouvert8d@psu.edu,Male,1618404,District of Columbia
643,644,Vasily,Warrillow,vwarrillowhv@arizona.edu,Male,1534003,Texas

# task 18

In [146]:
b=(pp
.query("""state=='Alabama' and salary < 100000""") 
).value_counts()
b.value_counts()

count
1    5
Name: count, dtype: int64

# task 19

In [151]:
bb=pp[pp['last_name'].str.endswith('n')]
(bb
.query("salary > 600000")
).head()

,id,first_name,last_name,email,gender,salary,state
22,23,Gilburt,Metson,gmetsonm@cornell.edu,Male,1034660,Idaho
26,27,Raymund,Dodgshon,rdodgshonq@cargocollective.com,Male,1096837,Illinois
42,43,Auroora,Startin,astartin16@webs.com,Female,612491,New York
65,66,Deana,Gerran,dgerran1t@columbia.edu,Female,1201146,Washington
67,68,Lauretta,Creavin,lcreavin1v@patch.com,Female,1732422,Texas

# task 20

In [154]:
bb=pp[pp['state']=='District of Columbia']
bb.groupby('salary').agg(['max'])
bb.head(1)

,id,first_name,last_name,email,gender,salary,state
0,1,Armin,Coltart,acoltart0@abc.net.au,Male,368693,District of Columbia

# task 21

In [155]:
bb=pp[(pp['gender']=='Female') & (pp['state']=='New York')]
(bb
.query("""salary > 500000 and salary < 1000000""") 
).head()

,id,first_name,last_name,email,gender,salary,state
42,43,Auroora,Startin,astartin16@webs.com,Female,612491,New York
81,82,Anna-diana,Lean,alean29@oracle.com,Female,846840,New York
173,174,Erma,Grimes,egrimes4t@senate.gov,Female,727051,New York
174,175,Allissa,Degoey,adegoey4u@1688.com,Female,650147,New York
193,194,Imogen,De la Yglesia,idelayglesia5d@slashdot.org,Female,567237,New York

# task 22

In [157]:
bb=pp[(pp['state']=='Texas') & (pp['email'].str.endswith('yahoo.com'))]
bb.head()

        id first_name last_name                  email  gender   salary  state
6485  6486   Johnette  Goldsack  jgoldsackdh@yahoo.com  Female  1430229  Texas

# task 23

In [165]:
pp['salary'].mean()   #992691----this is avg salary
pp[(pp['gender']=="Male") & (pp['state']=='California') & (pp['salary']<992691)]

,id,first_name,last_name,email,gender,salary,state
7,8,Jone,Pegden,jpegden7@washington.edu,Male,327962,California
49,50,August,D'Ambrosi,adambrosi1d@jiathis.com,Male,741351,California
86,87,Emmott,Smeeton,esmeeton2e@guardian.co.uk,Male,390998,California
157,158,Francklyn,Eake,feake4d@imgur.com,Male,699509,California
204,205,Ferdy,Dumbrall,fdumbrall5o@tamu.edu,Male,865124,California
...,...,...,...,...,...,...,...
11412,11413,Anatollo,Fearon,afearonbi@fotki.com,Male,674162,California
11427,11428,Pepito,Asaaf,pasaafbx@seesaa.net,Male,943060,California
11453,11454,Tammie,Whybray,twhybraycn@un.org,Male,3888,California
11504,11505,Morten,Biddiss,mbiddisse2@ow.ly,Male,304470,California
11627,11628,Gerrard,Bridge,gbridgehh@creativecommons.org,Male,756029,California

Empty DataFrame
Columns: [id, first_name, last_name, email, gender, salary, state]
Index: []